export const times = [
  //시간
  "00:00",
  "00:30",
  "01:00",
  "01:30",
  "02:00",
  "02:30",
  "03:00",
  "03:30",
  "04:00",
  "04:30",
  "05:00",
  "05:30",
  "06:00",
  "06:30",
  "07:00",
  "07:30",
  "08:00",
  "08:30",
  "09:00",
  "09:30",
  "10:00",
  "10:30",
  "11:00",
  "11:30",
  "12:00",
  "12:30",
  "13:00",
  "13:30",
  "14:00",
  "14:30",
  "15:00",
  "15:30",
  "16:00",
  "16:30",
  "17:00",
  "17:30",
  "18:00",
  "18:30",
  "19:00",
  "19:30",
  "20:00",
  "20:30",
  "21:00",
  "21:30",
  "22:00",
  "22:30",
  "23:00",
  "23:30",
];

export const occupations = [
  //업종
  "서비스 기타",
  "고객상담/인바운드",
  "텔레마케팅/아웃바운드",
  "영업관리/지원",
  "설문조사/리서치",
  "사무보조",
  "문서작성/자료조사",
];

export const headCounts = [
  //모집인원
  "1명",
  "0명 (10명 미만)",
  "00명 (100명 미만)",
  "직접입력",
];

export const workPeriods = [
  //근무기간
  "1년 이상",
  "6개월 ~ 1년",
  "3개월 ~ 6개월",
  "1개월 ~ 3개월",
  "1주일 ~ 1개월",
  "1주일 이하",
  "1일",
];

export const employTypes = [
  //고용형태
  "아르바이트",
  "정규직",
  "위촉직",
  "파견직",
  "인턴직",
  "교육생/연수생",
];

export const insurances = [
  //4대보험
  "국민연금",
  "건강보험",
  "고용보험",
  "산재보험",
];

export const vacations = [
  //휴가
  "연차",
  "월차",
  "정기휴가",
  "포상휴가",
];

export const incentives = [
  //수당제도
  "성과급",
  "경조금",
  "위험수당",
  "정기보너스",
  "퇴직금",
  "주휴수당",
  "초과근로수당",
  "야간근로수당",
  "휴일근로수당",
  "퇴직연금",
];

export const supports = [
  //기타지원
  "식사(식비) 지원",
  "교통비 지원",
  "건강검진",
  "기숙사",
  "통근버스운행",
  "휴게시간",
  "차량유지비",
  "자녀학자금",
  "사학연금",
];

export const treats = [
  //우대사항
  "동종업계 경력자",
  "관련 자격증 소지자",
  "컴퓨터 활용 가능자",
  "장기근무 가능자",
  "영어가능자",
  "일어가능자",
  "중국어가능자",
  "인근거주자",
  "운전면허 소지자",
  "원동기면허 소지자",
  "차량소지자",
  "경력단절자",
  "자소서 200자 이상",
];

export const conditions = [
  //기타조건
  "초보가능",
  "대학재학생 가능",
  "대학휴학생 가능",
  "주부가능",
  "재택근무 가능",
  "외국인 가능",
  "장애인 가능",
  "직장인 가능",
  "친구 동반 지원&근무 가능",
  "정규직 전환 가능",
];

export const genders = ["성별무관", "여자", "남자"];

export const educations = [
  "학력선택",
  "중학교 졸업 이상",
  "고등학교 졸업 이상",
  "대학(2,3년) 졸업 이상",
  "대학교(4년제) 졸업 이상",
  "석사 이상",
  "박사 이상",
  "학력무관",
];

export const applyRoutes = [
  "온라인지원",
  "문자지원",
  "채팅문의&지원",
  "이메일지원",
  "간편입사지원",
  "전화 후 방문",
  "방문접수",
  //"홈페이지",
  "기업바로지원",
];

export const phoneNums = [
  { value: "", txt: "선택" },
  { value: "010", txt: "010" },
  { value: "011", txt: "011" },
  { value: "016", txt: "016" },
  { value: "017", txt: "017" },
  { value: "018", txt: "018" },
  { value: "019", txt: "019" },
  { value: "02", txt: "02 (서울)" },
  { value: "031", txt: "031 (경기)" },
  { value: "032", txt: "032 (인천)" },
  { value: "033", txt: "033 (강원)" },
  { value: "041", txt: "041 (충남)" },
  { value: "042", txt: "042 (대전)" },
  { value: "043", txt: "043 (충북)" },
  { value: "044", txt: "044 (세종)" },
  { value: "051", txt: "051 (부산)" },
  { value: "052", txt: "052 (울산)" },
  { value: "053", txt: "053 (대구)" },
  { value: "054", txt: "054 (경북)" },
  { value: "055", txt: "055 (경남)" },
  { value: "061", txt: "061 (전남)" },
  { value: "062", txt: "062 (광주)" },
  { value: "063", txt: "063 (전북)" },
  { value: "064", txt: "064 (제주)" },
  { value: "070", txt: "070" },
  { value: "080", txt: "080" },
  { value: "090", txt: "0502 (KT)" },
  { value: "0505", txt: "0505 (Dacom)" },
  { value: "0606", txt: "0506 (Hanaro)" },
  { value: "no", txt: "지역번호 없음" },
  { value: "etc", txt: "기타" },
];

export const grades = [
  { value: 0, txt: "전체", des: "" },
  { value: 3, txt: "라이트", des: "메인 하단 노출" },
  { value: 2, txt: "골드", des: "메인 중단 노출" },
  { value: 1, txt: "플래티넘", des: "메인 상단 및 추천리스트 노출" },
];

export const sidoList = [
  "전국",
  "서울",
  "경기",
  "인천",
  "부산",
  "대구",
  "대전",
  "경남",
  "전남",
  "충남",
  "광주",
  "울산",
  "경북",
  "전북",
  "충북",
  "강원",
  "제주",
  "세종",
];
